package LastOne;
/*
Создать гонку, в которой каждый поток будет авто.
Каждому авто, нужно :

1. Подготовиться к гонке
2. Проехать участок большой дороги
3. Проехеать через тоннель
4. Проехать участок большой дороги

При этом есть условия:

1. Всего учатсников 10
2. У каждого авто разное время на подготовку к заезду, но стар одновременный
3. В тоннеле одновременно могут ехать только 3 машины
4. Когда все 10 закончат заезд, нужно вывести номер победителя и затраченное им время и список всех авто с результатом
5. У каждого авто долзно быть свое случ время, за которое оно готовится к гонке и за которое проезжает каждый маршрут

 */
public class Race {
    public static void main(String[] args) {

    }
}
